print ("hello,world")
"""
fafaga
"""
# pep 8

is_student = True # boll с большой Т и тлько с большой
name = input ("What is you name" )
print("Hello",name,'!')



# скаляр типы данных
# bool True or False
#int,float
# str

i1 = 666
i2 = 0x59
i3 = 0b01
i4 = 0o7
f1= 1.23
f2= 12e-3


s3 = r'Raw string'
s4= u'лох' # utf

# struct струтурированого типа
t2 = (True, 1,1.2,"string", (1,2,3))
t2[1] # ===1
# списки
lst1=[[],[],[],3,False]

lst1[3] ## === 3
# множество set
set1 = {1,2,3}
set2 = set() # пустое множество !!!элементы во множестве не повторяються!!!


# словари
d = {
    'id':1,
    'name': 'вася',
}
a = None

# lesson 3

# не изменяемые кортеж + скаляр
# все изменянимая отольное
"""
a =3
b=a
b=>a (копия а) по значению 

"""





# спец типы
a=None

t = (1, 2, 3)
#t[0]=456# error

s = "hell"
#s[0]="#" # error


dd = {
     (1,2,3) :123
}

print (dd[(1,2,3)])
#type (object) --> object тип данных

# 1 + "5"error
print (1 + int("5"))# в инт преорозование явное

# операторы
# арифмет +// целочисленное деление ,% остаток от деления ,** возвение в степень ,
# сравнение == это равно != не равно <> не равно > < => <=
#  = присваевания -= += *= /=  **= //= %=
# and or not логические операции
# Принадлежности in , not in () => 1 in lst
#  тождественности is , not is;  a is None
#lst = lst3 => lst is lst3 => true

# побитовое & i ^(x0r) ~ << >>




